---
kind: property
id: P:Autodesk.Revit.DB.ComponentRepeaterSlot.IsEmpty
source: html/083c8dcf-61be-2182-90f3-bdcb62c70302.htm
---
# Autodesk.Revit.DB.ComponentRepeaterSlot.IsEmpty Property

A flag indicating whether the slot is currently empty.

## Syntax (C#)
```csharp
public bool IsEmpty { get; }
```